; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-8-20)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-4 - location
	p1-5 - location
	p2-3 - location
	p2-4 - location
	p2-5 - location
	p3-0 - location
	p3-4 - location
	p3-5 - location
	p4-1 - location
	p6-0 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s5)
	(at driver4 s4)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at truck8 s3)
	(empty truck8)
	(at package1 s2)
	(at package2 s3)
	(at package3 s0)
	(at package4 s2)
	(at package5 s4)
	(at package6 s4)
	(at package7 s1)
	(at package8 s4)
	(at package9 s0)
	(at package10 s6)
	(at package11 s6)
	(at package12 s4)
	(at package13 s4)
	(at package14 s2)
	(at package15 s2)
	(at package16 s0)
	(at package17 s4)
	(at package18 s5)
	(at package19 s1)
	(at package20 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s5)
	(link s5 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s4)
	(link s4 s6)
)
	(:goal (and
	(at driver2 s0)
	(at driver4 s2)
	(at truck1 s4)
	(at truck4 s5)
	(at truck5 s3)
	(at truck6 s3)
	(at truck7 s1)
	(at truck8 s6)
	(at package1 s5)
	(at package3 s4)
	(at package5 s5)
	(at package6 s4)
	(at package8 s5)
	(at package9 s1)
	(at package10 s4)
	(at package11 s0)
	(at package12 s4)
	(at package13 s4)
	(at package14 s0)
	(at package15 s4)
	(at package16 s2)
	(at package18 s1)
	(at package20 s1)
	))


)

; plan
1. (board-truck driver1 s5 truck4)
   deleted: (at driver1 s5) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 4 of 23
2. (drive-truck driver1 s5 s2 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   goals met: 3 of 23
3. (load-truck s4 package8 truck2)
   deleted: (at package8 s4)
   added: (in package8 truck2)
   goals met: 3 of 23
4. (board-truck driver2 s4 truck2)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 3 of 23
5. (drive-truck driver2 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 3 of 23
6. (load-truck s0 package9 truck2)
   deleted: (at package9 s0)
   added: (in package9 truck2)
   goals met: 3 of 23
7. (load-truck s0 package3 truck2)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 3 of 23
8. (load-truck s0 package20 truck2)
   deleted: (at package20 s0)
   added: (in package20 truck2)
   goals met: 3 of 23
9. (load-truck s0 package16 truck2)
   deleted: (at package16 s0)
   added: (in package16 truck2)
   goals met: 3 of 23
10. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 3 of 23
11. (drive-truck driver1 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 3 of 23
12. (disembark-truck driver1 s1 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 3 of 23
13. (unload-truck s2 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s2)
   goals met: 4 of 23
14. (load-truck s2 package15 truck2)
   deleted: (at package15 s2)
   added: (in package15 truck2)
   goals met: 4 of 23
15. (load-truck s2 package14 truck2)
   deleted: (at package14 s2)
   added: (in package14 truck2)
   goals met: 4 of 23
16. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 4 of 23
17. (walk driver4 s4 p2-4)
   deleted: (at driver4 s4)
   added: (at driver4 p2-4)
   goals met: 4 of 23
18. (drive-truck driver2 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 4 of 23
19. (load-truck s4 package5 truck2)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   goals met: 4 of 23
20. (drive-truck driver2 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 4 of 23
21. (unload-truck s5 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s5)
   goals met: 5 of 23
22. (unload-truck s5 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s5)
   goals met: 6 of 23
23. (drive-truck driver2 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 6 of 23
24. (unload-truck s4 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s4)
   goals met: 7 of 23
25. (drive-truck driver2 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 7 of 23
26. (load-truck s6 package11 truck2)
   deleted: (at package11 s6)
   added: (in package11 truck2)
   goals met: 7 of 23
27. (drive-truck driver2 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 7 of 23
28. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 8 of 23
29. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 8 of 23
30. (walk driver3 s5 p3-5)
   deleted: (at driver3 s5)
   added: (at driver3 p3-5)
   goals met: 8 of 23
31. (walk driver3 p3-5 s3)
   deleted: (at driver3 p3-5)
   added: (at driver3 s3)
   goals met: 8 of 23
32. (board-truck driver3 s3 truck8)
   deleted: (at driver3 s3) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 8 of 23
33. (drive-truck driver3 s3 s0 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s0)
   goals met: 8 of 23
34. (drive-truck driver3 s0 s6 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s6)
   goals met: 9 of 23
35. (load-truck s6 package10 truck8)
   deleted: (at package10 s6)
   added: (in package10 truck8)
   goals met: 9 of 23
36. (walk driver4 p2-4 s2)
   deleted: (at driver4 p2-4)
   added: (at driver4 s2)
   goals met: 10 of 23
37. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 10 of 23
38. (unload-truck s0 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s0)
   goals met: 11 of 23
39. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 11 of 23
40. (drive-truck driver2 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 11 of 23
41. (load-truck s5 package18 truck2)
   deleted: (at package18 s5)
   added: (in package18 truck2)
   goals met: 11 of 23
42. (drive-truck driver2 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 11 of 23
43. (unload-truck s1 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s1)
   goals met: 12 of 23
44. (unload-truck s1 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s1)
   goals met: 13 of 23
45. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 13 of 23
46. (drive-truck driver2 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 13 of 23
47. (unload-truck s4 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s4)
   goals met: 14 of 23
48. (drive-truck driver2 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 14 of 23
49. (drive-truck driver3 s6 s4 truck8)
   deleted: (at truck8 s6)
   added: (at truck8 s4)
   goals met: 13 of 23
50. (unload-truck s4 package10 truck8)
   deleted: (in package10 truck8)
   added: (at package10 s4)
   goals met: 14 of 23
51. (drive-truck driver3 s4 s6 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s6)
   goals met: 15 of 23
52. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 15 of 23
53. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 15 of 23
54. (unload-truck s1 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s1)
   goals met: 16 of 23
55. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 16 of 23
56. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 16 of 23
57. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 17 of 23
58. (board-truck driver2 s0 truck6)
   deleted: (at driver2 s0) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 16 of 23
59. (unload-truck s0 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 16 of 23
60. (load-truck s0 package1 truck6)
   deleted: (at package1 s0)
   added: (in package1 truck6)
   goals met: 16 of 23
61. (drive-truck driver2 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 17 of 23
62. (drive-truck driver2 s3 s5 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   goals met: 16 of 23
63. (unload-truck s5 package1 truck6)
   deleted: (in package1 truck6)
   added: (at package1 s5)
   goals met: 17 of 23
64. (drive-truck driver2 s5 s3 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   goals met: 18 of 23
65. (board-truck driver4 s2 truck7)
   deleted: (at driver4 s2) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 17 of 23
66. (drive-truck driver4 s2 s1 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s1)
   goals met: 18 of 23
67. (board-truck driver1 s1 truck4)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 18 of 23
68. (drive-truck driver1 s1 s5 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   goals met: 19 of 23
69. (disembark-truck driver4 s1 truck7)
   deleted: (driving driver4 truck7)
   added: (at driver4 s1) (empty truck7)
   goals met: 19 of 23
70. (board-truck driver4 s1 truck5)
   deleted: (at driver4 s1) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 19 of 23
71. (drive-truck driver4 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 19 of 23
72. (drive-truck driver1 s5 s1 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   goals met: 18 of 23
73. (disembark-truck driver1 s1 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 18 of 23
74. (board-truck driver1 s1 truck1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 18 of 23
75. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 18 of 23
76. (drive-truck driver1 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 19 of 23
77. (drive-truck driver2 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 18 of 23
78. (disembark-truck driver2 s0 truck6)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 19 of 23
79. (disembark-truck driver4 s2 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s2) (empty truck5)
   goals met: 20 of 23
80. (disembark-truck driver1 s4 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 20 of 23
81. (walk driver1 s4 p4-1)
   deleted: (at driver1 s4)
   added: (at driver1 p4-1)
   goals met: 20 of 23
82. (walk driver1 p4-1 s1)
   deleted: (at driver1 p4-1)
   added: (at driver1 s1)
   goals met: 20 of 23
83. (board-truck driver1 s1 truck4)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 20 of 23
84. (drive-truck driver1 s1 s5 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   goals met: 21 of 23
85. (board-truck driver4 s2 truck5)
   deleted: (at driver4 s2) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 20 of 23
86. (drive-truck driver4 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 21 of 23
87. (disembark-truck driver4 s3 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s3) (empty truck5)
   goals met: 21 of 23
88. (walk driver4 s3 p2-3)
   deleted: (at driver4 s3)
   added: (at driver4 p2-3)
   goals met: 21 of 23
89. (walk driver4 p2-3 s2)
   deleted: (at driver4 p2-3)
   added: (at driver4 s2)
   goals met: 22 of 23
90. (board-truck driver2 s0 truck6)
   deleted: (at driver2 s0) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 21 of 23
91. (drive-truck driver2 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 22 of 23
92. (disembark-truck driver2 s3 truck6)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 22 of 23
93. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 22 of 23
94. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 23 of 23
